//=======================================================================================
// Dealer.cpp
// ディーラー関連のソースファイル
//=======================================================================================

// ヘッダファイルの読み込み ================================================
#include <iostream>
#include "Dealer.h"
#include "Hand.h"
#include "Wallet.h"
#include "CardManager.h"
#include "CoinManager.h"

using namespace std;

// 定数の定義 ==============================================================

//================================================================
// コンストラクタ
//================================================================
Dealer::Dealer()
{
	m_hand = new Hand();
	m_wallet = new Wallet();
}

//================================================================
// デストラクタ
//================================================================
Dealer::~Dealer()
{
	delete m_hand;
	delete m_wallet;
}

//================================================================
// 所持コインの表示
//================================================================
void Dealer::GetDealerCoin()
{
	for (int i = 0; i < 1000; i++)
	{
		Coin* coin = CoinManager::GetInstance()->DistributeCoin();
		m_wallet->AddWallet(coin);
	}
}

//================================================================
// 所持コインの表示
//================================================================
void Dealer::ShowDealerWallet()
{
	cout << endl;
	cout << "ディーラーの所持コイン : " ;
	m_wallet->ShowWallet();
}

//================================================================
// 手札に２枚カードを追加する
//================================================================
void Dealer::TwoCardsAddDealerHands()
{
	m_hand->AddHand(CardManager::GetInstance()->DrawCard());
	m_hand->AddHand(CardManager::GetInstance()->DrawCard());
}

//================================================================
// 手札に１枚カードを追加する
//================================================================
void Dealer::OneCardAddDealerHands()
{
	m_hand->AddHand(CardManager::GetInstance()->DrawCard());
}

//================================================================
// 手札の表示
//================================================================
void Dealer::ShowDealerHands()
{
	cout << endl;
	cout << "====== ディーラーの手札 ======" << endl;;
	m_hand->ShowDealerHand();
}

//================================================================
// 手札の合計値を表示する
//================================================================
void Dealer::ShowDealerTotalRank()
{
	m_hand->TotalRankInHands();
}
