//=======================================================================================
// Hand.cpp
// 手札関連のソースファイル
//=======================================================================================

// ヘッダファイルの読み込み ================================================
#include <iostream>
#include "Hand.h"
#include "Card.h"

using namespace std;

// 定数の定義 ==============================================================

//================================================================
// コンストラクタ
//================================================================
Hand::Hand()
{
	for (int i = 0; i < 11; i++)
	{
		m_card[i] = nullptr;
	}
	m_count = 0;
	m_rankCount = 0;
}

//================================================================
// デストラクタ
//================================================================
Hand::~Hand()
{
}

//================================================================
// ドローしたカードを手札へ追加(Hit)
//================================================================
void Hand::AddHand(Card* card)
{
	for (int i = 0; i < 11; i++)
	{
		if (m_card[i] == nullptr)
		{
			m_card[i] = card;

			if (card->m_rank > 10)
			{
				card->m_rank = 10;
			}
			if (card->m_rank < 2)
			{
				bool which = false;

				cout << endl;
				cout << "Aを1として扱いますか？" << endl;
				cout << "Yes(1) / No(0)" << endl;

				cin >> which;

				if (which == true)
				{
					card->m_rank = 1;
				}
				else
				{
					card->m_rank = 11;
				}
			}
			m_rankCount += card->m_rank;

			m_count++;
			break;
		}
	}
}

//================================================================
// 手札の表示
//================================================================
void Hand::ShowHand()
{

	for (int i = 0; i < 11; i++)
	{
		if (m_card[i]!=nullptr)
		{
			m_card[i]->ShowCard();
		}
	}
	cout << endl;
	cout << "現在のカード枚数 : " << m_count << "枚" << endl;
}

//================================================================
// 手札の１枚目を表示（ディーラー専用）
//================================================================
void Hand::ShowDealerHand()
{
	if (m_card[0] != nullptr)
		m_card[0]->ShowCard();
	cout << endl;
	cout << "現在のカード枚数 : " << m_count << "枚" << endl;
}

//================================================================
// 手札のカードランクの合計値表示
//================================================================
void Hand::TotalRankInHands()
{
	cout << "現在のランクの合計値 : " << m_rankCount << endl;
	cout << endl;
}

//================================================================
// 判定
//================================================================
int Hand::Judge()
{
	if (m_rankCount == 21)
	{
		cout << endl;
		cout << "合計値２１、勝利" << endl;
		return 1;
	}
	else if (m_rankCount < 17)
	{
		cout << endl;
		cout << "合計値１６以下のため、強制的にＨｉｔ、Ｓｔａｎｄ不可" << endl;
		return 2;
	}
	else if (m_rankCount < 17 && m_rankCount>21)
	{
		cout << endl;
		cout << "合計値１７以上２０以下のため、Ｈｉｔが可能" << endl;
	}
	else if (m_rankCount > 21)
	{
		cout << endl;
		cout << "合計値２２以上のため、Ｂｕｒｓｔ" << endl;
		return 3;
	}
}