//=======================================================================================
// Player.cpp
// プレイヤー関連のソースファイル
//=======================================================================================

// ヘッダファイルの読み込み ================================================
#include <iostream>
#include "Player.h"
#include "Hand.h"
#include "Wallet.h"
#include "CardManager.h"
#include "CoinManager.h"

using namespace std;

// 定数の定義 ==============================================================

//================================================================
// コンストラクタ
//================================================================
Player::Player()
{
	m_hand = new Hand();
	m_wallet = new Wallet();
}

//================================================================
// デストラクタ
//================================================================
Player::~Player()
{
	delete m_hand;
	delete m_wallet;
}

//================================================================
// コインを受け取る
//================================================================
void Player::GetPlayerCoin()
{
	for (int i = 0; i < 1000; i++)
	{
		Coin* coin = CoinManager::GetInstance()->DistributeCoin();
		m_wallet->AddWallet(coin);
	}
}
//================================================================
// 所持コインの表示
//================================================================
void Player::ShowPlayerWallet()
{
	cout << endl;
	cout << "プレイヤーの所持コイン : ";
	m_wallet->ShowWallet();
}

//================================================================
// 手札に２枚カードを追加する
//================================================================
void Player::TwoCardsAddPlayerHands()
{
	m_hand->AddHand(CardManager::GetInstance()->DrawCard());
	m_hand->AddHand(CardManager::GetInstance()->DrawCard());
}

//================================================================
// 手札に１枚カードを追加する
//================================================================
void Player::OneCardAddPlayerHands()
{
	m_hand->AddHand(CardManager::GetInstance()->DrawCard());
}

//================================================================
// 手札の表示
//================================================================
void Player::ShowPlayerHands()
{
	cout << endl;
	cout << "====== プレイヤーの手札 ======" << endl;
	m_hand->ShowHand();
}

//================================================================
// 手札の合計値を表示する
//================================================================
void Player::ShowPlayerTotalRank()
{
	m_hand->TotalRankInHands();
}

//================================================================
// ベットする
//================================================================
void Player::BetPlayerCoins(int bet)
{
	m_wallet->BetCoin(bet);
}

//================================================================
// 判定
//================================================================
int Player::PlayerJudge()
{
	return m_hand->Judge();
}

//================================================================
// 報酬を受け取る
//================================================================
void Player::CompensationPlayerCoins(int compensation)
{
	m_wallet->CompensationCoin(compensation);
}
